chore: clean-up doc
